[{"id":"pestering-gmmk-pro","name":"Pestering GMMK Pro","date":"2021-10-23","images":[{"name":"pestering-gmmk-pro.png","width":1124,"height":450}],"status":"available","type":"75%","switches":"kailh polia","colors":["black","purple"],"wired":"usb-c","wireless":null,"numberOfKeys":83,"lighting":"rgb","dimensions":{"width":332,"height":0,"length":135},"weight":0,"contentHtml":"<p>Probably the most common starter board at this point; the GMMK Pro. Base kit generally in stock and for a good price. Unfortunately, this kit was a pushed a little too hard in the media. It suffers from some serious design flaws, with a mishmash of various screw types, and insane amount of screws and generally poor planning. For being Glorious first kit, it’s not bad.</p>\n<p>The StupidFish foam inlays does help a lot with sound, but due to the poor design more foam is probably needed, but this specific unit suffers from too much pressure on the PCB if too much foam is used. Had to settle with actually being able to use the board with a pretty decent sound.</p>\n<p>Clearly I’m on a purple-ish roll, and the lavender puddings and Akko just looked so damn good on this board. It’s a bit too big for shooters, but any MMO or Strategy player might find the TKL a perfect match. Big ups for the spinny wheel; completely useless in my case, but super satisfying to turn it.</p>\n<p>All in all, despite heaps of room for improvement, this board is good. It’s hefty, got decent sound, and comes in at a stellar price. Frag out young gamer, frag out.</p>\n<p>Details:</p>\n<ul>\n<li>GMMK Pro Black</li>\n<li>Stock stabs, lubed, end wrapped</li>\n<li>lubed Kailh Polia</li>\n<li>Glorious Black Pudding w Lavender pudding and Akko accents + a milk drop for flare</li>\n<li>StupidFish foam</li>\n<li>RGB for extra speed</li>\n</ul>\n"},{"id":"rip-dia-kon-momo-dk63","name":"Rip-DIA Kon Momu — DK63","date":"2021-10-23","images":[{"name":"rip-dia-kon-momo-dk63.png","width":1299,"height":450}],"status":"available","type":"60%","switches":"gateron black","colors":["white","red"],"wired":"usb-c","wireless":{"chip":"bluetooth 5.1","battery":"1900mAh"},"numberOfKeys":63,"lighting":"rgb","dimensions":{"width":340,"height":0,"length":140},"weight":0,"contentHtml":"<p>Ok, all right, fine, this isn’t necessarily a board for gamers, but you can definitely game on it. And the Gat blacks obviously provides a sound that makes the entire office come over and drool. Origin is simple; I found a Dierya DK63 cheap and couldn’t resist because the form factor is nice, it got that Bluetooth and USB-C. So is it any good?</p>\n<p>I’d argue, in its standard format out the box, the DK63 is kind of what you would expect from any cheaper bt combo board. Not on par with Anne Pro or Akko but not terrible. Obviously, the original brown or red switches and stabs all needed replacing or a big chunk of love.</p>\n<p>First of all, the DK63 is not a hot swap so all the whatever switches needed to go. I kept the stock stabs as they seemed fine, just needed a decent amount of lube and some end wraps to eliminate any rattle. For swtiches I went with Gateron Blacks lubed with 205g0 since I intended to test this out in the office. The sound in plastic cases can’t be compared to a proper aluminum case, but it got good once I taped modded the board. Dropped a Kon Momo set on to go with the white case and for what it was, this thing is banging. I’ve already got offers on it, but I don’t know, kinda hard to let go of DIA. Miss a lot!</p>\n<p>Details:</p>\n<ul>\n<li>Dierya DK63</li>\n<li>Stock stabs, lubed, end wrapped</li>\n<li>lubed Gateron Blacks</li>\n<li>Kon Momo keycaps</li>\n<li>Tape modded</li>\n<li>RGB to impress the ladies</li>\n</ul>\n"},{"id":"purblebeck-pudding-paradise-sk64","name":"Purblebeck Pudding Paradise — SK64","date":"2021-07-15","images":[{"name":"purblebeck-pudding-paradise-sk64.png","width":1239,"height":450}],"status":"sold","type":"60%","switches":"arctos","colors":["pink","lightblue","purple"],"wired":"mini-b usb","wireless":null,"numberOfKeys":64,"lighting":"rgb","dimensions":{"width":295,"height":0,"length":105},"weight":0,"contentHtml":"<p>Moar purple! Moar puddings!</p>\n<p>We heard you like purple and puddings so we put pink puddings with purple LED gonzo, and you love it!</p>\n<p>It’s a Kebo DZ60 underglow RGB pcb in an acrylic case with purple top leds. Add some pink puddings, white blanks, and purple Akko accents and you find yourself in Purple pudding paradise. Add a set of lubed Arctos 72g for a smooth, velvety clicking experience.</p>\n<p>Details:</p>\n<ul>\n<li>Acrylic low profile case</li>\n<li>Kebo DZ60 RGB</li>\n<li>Arctos 72g lubed with Krytox 203g0 mix</li>\n<li>Band-aid modded, lubed cherry stabs</li>\n<li>Pink puddings, white blank mods and purple Akko accents</li>\n<li>Purple top leds</li>\n<li>Full underglow RGB</li>\n</ul>\n"},{"id":"purple-kiss-nk65","name":"Purple Kiss — NK65","date":"2021-04-28","images":[{"name":"purple-kiss-nk65.png","width":1184,"height":450}],"status":"main","type":"65%","switches":"kailh polia","colors":["black","purple","white"],"wired":"usb-c","wireless":null,"numberOfKeys":68,"lighting":"rgb","dimensions":{"width":0,"height":0,"length":0},"weight":0,"contentHtml":"<p>Every gamer knows that the more purple and pink you add to your setup, the better you become, so went all out. Sweet like lavender honey, savory like.. shit I don’t know. We wanted solid aluminum case, a lot of purple, RGB, and top of the line gaming switches.</p>\n<p>At it’s core it’s a black NK65 with Cherry Gold plate mounted stabs. All clipped and lubed up as should be. Switch choice landed on the less known, and very very underrated Kailh Polia lubed with NK Krytox 204g00. HK Gaming purple puddings and rubber WASD and arrow clusters. A novelty Esc key and blank milks for the additional keys.</p>\n<p>Having tried a chunk popular tactile switches we wanted something less sensitive than the Gods of gaming Kailh Speed Copper, but with enough kick let us know we’re actually pressing the keys. Marketing aside, once lubed with 204g00 these switches are fantastic. No problem typing away during work hours and jumping immediately into long sessions of your favorite fps game. These switches, perhaps looked down upon by the typist coffee-shop cactus plant miniature elite andy community are tippety top all-around gaming switches.</p>\n<p>Details:</p>\n<ul>\n<li>Tron Black NK65 V1</li>\n<li>Kailh Polia lubed with NK Krytox 204g00</li>\n<li>Band-aid modded, clipped, lubed Cherry gold plate stabs</li>\n<li>HK Gaming purple pudding, black pudding, and purple rubber caps, with a couple of milks for garnish.</li>\n<li>Custom purple double sleeves aviator cable</li>\n</ul>\n"},{"id":"purplebeck-v2-sk64","name":"Purplebeck V2 — SK64","date":"2021-04-28","images":[{"name":"purplebeck-v2-sk64.png","width":1289,"height":450}],"status":"available","type":"60%","switches":"gateron clear","colors":["white","purple"],"wired":"usb-c","wireless":null,"numberOfKeys":64,"lighting":"rgb","dimensions":{"width":295,"height":0,"length":105},"weight":0,"contentHtml":"<p>More Purple and pink? Eh yeah bebe, a lot more. Since we already have a solid Purple gaming keyboard in the Purple Kiss NK65 it was time to make a purple general purpose keyboard. Aimed more towards a comfortable typing experience, but well equipped to handle everything thrown at it.</p>\n<p>At its core it’s an underglow DZ60 with purple single color leds soldered to it, giving a beautiful unison glow from top to bottom, almost as if was a single light source. The case is a regular poker acrylic 60% diffusing the underglow absolutely fantastic with a sleek look even with the underglow off. We’ve tried adding weights and stuff to get that nice heft, but nothing beats a good ol brass plate, which is why we had to go with it.</p>\n<p>The switches were a bit of an experiment where we simply swapped out the stock Gateron Clear springs with a set of 80g. Surprisingly, or maybe not, the swapped springs bring the Clears to the next level, with a buttery silky smooth bebe bebe typing experience. No fatigue, but enough force to let you know that you’re interacting with them. What a jackpot this turned out to be.</p>\n<p>Caps are a color matched set from Geek Social offering good quality at a very reasonable price. Purple puddings were added on the arrow cluster and Esc key to give some nice accents to the look.</p>\n<p>Details:</p>\n<ul>\n<li>KBDFans 60% Acryclic Poker</li>\n<li>DZ60 RGB</li>\n<li>Gateron Clear w 80g springs. Lubed.</li>\n<li>Band-aid modded, clipped, lubed screw-in stabs.</li>\n<li>Geek Social Purple Tang with Purple Pudding arrows and Esc.</li>\n<li>Purple single color leds, full RGB underglow.</li>\n</ul>\n"},{"id":"end-ultimate-gk64","name":"End.Ultimate — GK64","date":"2020-10-16","images":[{"name":"end-ultimate-gk64.png","width":1289,"height":450}],"status":"endgame","type":"60%","switches":"zilent","colors":["black","red","white"],"wired":"usb-c","wireless":null,"numberOfKeys":64,"lighting":"rgb","dimensions":{"width":0,"height":0,"length":0},"weight":0,"contentHtml":"<p>Difference. Everybody have different taste, we are drawn to different things. This keyboard doesn’t care, it’s a keyboard! But it’s superior, it’s better than you, better than the opposition. It knows it, and as soon as you put your hands on it, you know it. You might switch it out, but you’ll be right back with it. You might hate how it looks, but you’ll lovingly stare at it anyways. It made the decision for you. It’s the end. It’s End.Ultimate.</p>\n<p>It all starts with the Tron aluminum case. Solid, hefty, and a diffuser plate that lets just enough light through from the SMD leds. You pop an underglow PCB in this and it’ll be a party. We elected for something more subtle. The PCB is a simple hotswap GK64. It does it all, and it does it all well. We modded the plate so we can use a Durock PCB mounted while the others are stock plate mounts.</p>\n<p>What really makes this thing go are the Zilents 62g. Lightly lubed with Novelkeys 204g0. They’re very tactile like other ZealPC switches, but light enough to be comfortable, all while not making a fuss about it. The WASD cluster and spacebar are lubed Kailh Speed Copper – the best gaming switch around. As a package, you get a set of switches that let’s you type away and hit those macros without miss-pressing, while letting your full speed loose on the cluster.</p>\n<p>The caps is a feature film of itself. It all starts with backlit Korean ANSI base keys with outlined mods with red accents. The WASD cluster is a set of fully transparent blank milk caps, for that ultimate RGB. Spacebar is our signature 3Bd backlit beast. Together they form a tasteful hyper aggression, the end of all keyboard designs.</p>\n<p>It don’t matter what your neighbor bought at best buy, or how many hundreds he paid for that pre-built snake thing. When you’re with this thing, you know you’re above them. You know you have the power to end them at your will.</p>\n<p>Details:</p>\n<ul>\n<li>Tron 60% aluminum case with 360 degree underglow diffuser plate.</li>\n<li>GK64 PCB.</li>\n<li>ZealPC Zilents 62g + Kailh Speed Copper. Lubed.</li>\n<li>Band-aid modded, clipped, lubed screw-in Durock spacebar stab and clip in plate stabs for the others.</li>\n<li>Backlit KPRepublic Korean Root base with YMDK Outlined mods, signature 3Bd spacebar and blank milk WASD caps.</li>\n<li>Full RGB.End.</li>\n</ul>\n"},{"id":"rose-gold-royalty-gk64","name":"Rose Gold Royalty — GK64","date":"2020-10-16","images":[{"name":"rose-gold-royalty-gk64.png","width":1280,"height":450}],"status":"available","type":"60%","switches":"kailh box crystal","colors":["pink","white","gray"],"wired":"usb-c","wireless":null,"numberOfKeys":64,"lighting":"rgb","dimensions":{"width":340,"height":0,"length":140},"weight":0,"contentHtml":"<p>Engagement ring? Engagement Keyboard!</p>\n<p>Why give her a boring old ring when you can give her the ultimate frag tool? Let her rise up like the royalty she is to you and show her your loyalty with a true Royal keyboard; or take the throne yourself and reign supreme.</p>\n<p>We started off with a subtle yet elegant low profile aluminum case in a stunning rose gold color. Depending on the light it changes from peach, to silver, to rose gold; all which catches the eye and leads them to the inverted pudding caps and the regular pudding accents. Speaking of accents, blast that RGB on full and the pudding accents will let you know their presence, while the inverted puddings gently lets some light out.</p>\n<p>We matched the case and caps with a set of Kailh Box Crystal Royal emphasizing the true superiority in this board. Crystal Royals feel snappy and light, offering a perfect blend for typing and fragging.</p>\n<p>She was born to be Royalty, you were born to be her Champion.</p>\n<p>Details:</p>\n<ul>\n<li>Low profile Rose Gold aluminum case</li>\n<li>GK64 PCB</li>\n<li>Kailh Box Crystal Royals</li>\n<li>Band-aid modded, clipped, lubed screw and clip in PCB stabs</li>\n<li>Inverted salmon pink puddings with white pudding clusters and grey accents</li>\n<li>Full RGB, full Royalty</li>\n</ul>\n"},{"id":"rustic-rosewood-gk64","name":"Rustic Rosewood — GK64","date":"2020-10-13","images":[{"name":"rustic-rosewood-gk64.png","width":"1229","height":450}],"status":"sold","type":"60%","switches":"zealios","colors":["brown","white","black"],"wired":"usb-c","wireless":null,"numberOfKeys":64,"lighting":"rgb","dimensions":{"width":320,"height":0,"length":150},"weight":0,"contentHtml":"<p>Serene, surreptitious, superior.</p>\n<p>Another wood case screaming salubrity but hiding serious power underneath.</p>\n<p>We oiled the case with Old English scratch cover, for that extra smooth surface and durability to withstand night long creative or gaming sessions. We modded a metal plate to allow PCB screw in stabs on the spacebar and enter keys, combined with the stock plate mounted stabs. Some of the artisan caps were sanded down to avoid slamming into the plate as well.</p>\n<p>The switch choice was easy; we needed something capable of some serious fragging but honoring the typist feel of the keyboard, Zealios 62G fits that description perfect. Switches lubed with Novelkeys 204g0 for an intense smoothness.</p>\n<p>The result is the perfect companion; sophisticated poet by day, colorful party animal by night.</p>\n<p>Details:</p>\n<ul>\n<li>Oiled Rosewood 60% case</li>\n<li>GK64 PCB</li>\n<li>Zealios 62G lubed with Novelkeys 204g0</li>\n<li>Band-aid modded, lubed screw in and plate stabs</li>\n<li>White ANSI base caps with Chinese inspired accents</li>\n<li>Full RGB</li>\n</ul>\n"},{"id":"bent-steel-slautr-dz60","name":"Bent Steel Slautr — DZ60","date":"2020-07-16","images":[{"name":"bent-steel-slautr-dz60.png","width":1217,"height":450}],"status":"available","type":"60%","switches":"gateron black","colors":["white","darkblue","gray","red"],"wired":"mini-b usb","wireless":null,"numberOfKeys":64,"lighting":"rgb","dimensions":{"width":0,"height":0,"length":0},"weight":0,"contentHtml":"<p>Ever since seeing this case I’ve been wanting to work with it. The simple yet aggressive curves combined with the diffuser plate gives it a futuristic and unique look with a solid functional unibody design. It sports a contemporary look with black on dark grey mods, with a cream Korean base and a couple of red accents.</p>\n<p>Originally with Novelkeys x Kailh Speed Heavy Burnt Orange, which proved a bit too thick and heavy. Out with them! Now updated with snappy and smooth Longhua Blacks.</p>\n<p>Details:</p>\n<ul>\n<li>Steel bent case with acrylic diffuser</li>\n<li>Kebo DZ60 RGB</li>\n<li>Previously: Novelkeys X Kailh Speed Heavy Burnt Orange lubed with Krytox 203g0 mix</li>\n<li>Currently: Longhua (Kailh) Black (CPG151101D01) lubed with Novelkeys 204g0</li>\n<li>Band-aid modded, lubed, screw in stabs</li>\n<li>low profile Cream ANSI/Korean caps with black on dark grey mods and red accents</li>\n<li>Red top leds</li>\n<li>Full underglow RGB</li>\n</ul>\n"},{"id":"silver-bullit-sk61","name":"Silver Bullit — SK61","date":"2020-07-15","images":[{"name":"silver-bullit-sk61.png","width":1288,"height":450}],"status":"sold","type":"60%","switches":"kailh speed copper","colors":["white","darkgray","pink","cyan"],"wired":"usb-c","wireless":null,"numberOfKeys":61,"lighting":"rgb","dimensions":{"width":0,"height":0,"length":0},"weight":0,"contentHtml":"<p>Sharp, shiny, and fast as f**k!</p>\n<p>This is the Silver Bullit, and boi it’s fast. It’s kind of like a lighter, more agile version of the Tofu60. Built on a low profile alu case with an SK61 PCB and plate. This things pops with the white and grey with candy pink and bubblegum teal accents. Turn that RGB on late at night and you’re blazing off to the stars; blasting your opponents to dust.</p>\n<p>Details:</p>\n<ul>\n<li>Low profile silver alu case</li>\n<li>SK61 PCB and plate</li>\n<li>Currently: Kailh Speed Copper lubed with G203g0 mix</li>\n<li>Band-aid modded, lubed stock SK61 stabilizers</li>\n<li>White pudding, grey backlit mods w pink and teal pudding accents</li>\n<li>Full RGB BLASTING through the pudding caps</li>\n<li>Kills warewolves</li>\n</ul>\n"},{"id":"wild-wood-sk61-w2","name":"Wild Wood — SK61-W2","date":"2020-07-05","images":[{"name":"wild-wood-sk61-w2.png","width":1219,"height":450}],"status":"sold","type":"60%","switches":"hako violet","colors":["lightbrown","darkgray"],"wired":"usb-c","wireless":null,"numberOfKeys":61,"lighting":"rgb","dimensions":{"width":340,"height":0,"length":140},"weight":0,"contentHtml":"<p>For the creator; the strategist; the typist, clacking away at new game plans or writing the next big poem. Inspired by simple motions, colors, and lines in nature, highlighting the users creative freedom.</p>\n<p>This is SK61-W2: Wild Wood.</p>\n<p>Based on an SK61 hotswap PCB and plate in a bamboo two piece case. We elected to go with Hako Violet switches producing a blissful sound with a serene tactile bump; each press validating yet light. Stabs bandaid modded and lubed with our own G205g0 mix. Caps are an assortment of natural colored cherry profile complementing the natural look of the case.</p>\n<p>Details:</p>\n<ul>\n<li>Bamboo two piece wood case</li>\n<li>Stock SK61 PCB</li>\n<li>Stock SK61 plate</li>\n<li>Hako Violets (Boxed)</li>\n<li>Band-aid modded, lubed, stock SK61 stabilizers</li>\n<li>Assorted cherry profile caps</li>\n<li>Full RGB</li>\n</ul>\n"},{"id":"pina-coladas-in-miami-88-tofu60-gk64","name":"Pina Coladas in Miami '88 — Tofu60 GK64","date":"2020-05-12","images":[{"name":"pina-coladas-in-miami-88-tofu60-gk64.png","width":1219,"height":450}],"status":"sold","type":"60%","switches":"zealios v2","colors":["gray","white","pink","cyan"],"wired":"usb-c","wireless":null,"numberOfKeys":64,"lighting":"rgb","dimensions":{"width":0,"height":0,"length":0},"weight":0,"contentHtml":"<p>This build right here is a prototype for a commission, but might just be our favorite so far.</p>\n<p>The Tofu60 case is not just hefty and sturdy, but absolutely gorgeous too. Paired with a hotswap GK64 PCB from a stock prebuilt and we have a versatile and powerful board.</p>\n<p>To achieve a good compatibility with the hotswap PCB the original plate was sanded down on all sides until it fit the case perfectly. We then popped in a full set of Zealios V2s lubed with GPL 203 and a Speed Copper for the space key. We kept the original stabs but band aid moodded the PCB and clipped and lubed the stabs with GPL 205. As a final touch we elected for white Pudding base caps, for that extra RGB sensation, with grey modifiers, and two different Miami Punch accents and an artisan space bar. Perfect for those sunny days on the beach.</p>\n<p>We really like this board! It wasn’t intended for gaming with the tactile Zealios V2 switches, but has the ability to turn it up with its full RGB and hotswap sockets.</p>\n<p>Details:</p>\n<ul>\n<li>Silver Tofu60 aluminum case</li>\n<li>GK64 hotswap full RGB PCB</li>\n<li>Modded stock GK64 alu plate</li>\n<li>Zealios V2 lubed with GPL 203</li>\n<li>Band-aid modded, lubed stock GK64 stabilizers</li>\n<li>White pudding + Grey mods + Miami Punch 2x + Artisan space caps</li>\n<li>Full RGB</li>\n<li>Perfect for both chilling with a Pina Colada in the afternoon as for that hot Miami beach party.</li>\n</ul>\n"},{"id":"signature-gaming-anode-aluminum-gk64","name":"Signature Gaming — Anode Aluminum GK64","date":"2020-05-12","images":[{"name":"signature-gaming-anode-aluminum-gk64.png","width":1296,"height":450}],"status":"sold","type":"60%","switches":"kailh box brown","colors":["black","red"],"wired":"usb-c","wireless":null,"numberOfKeys":64,"lighting":"rgb","dimensions":{"width":0,"height":0,"length":0},"weight":0,"contentHtml":"<p>Another commission. This one was actually the first one we received. It’s been a long time in the making and although some caps are still in transit, we’re so excited about the result we might leave it as is.</p>\n<p>The build starts with a Black Anode Aluminum case with a GK64 RGB Hotswap PCB. Like with the Tofu build the plated needed some minor sanding to fit snug in the case. We added a few electrical tape strips to cushion the contact. The PCB was band aid modded, stabs clipped and lubed with GPL 205. Box Brown switches offers good typing and snappy gaming performance, perfect for long coding sessions and mid night frag outs. We kept some of the stock caps but swapped the mid base and arrow cluster for Black Puddings to highlight the per key RGB. WASD cluster replaced with Tai-Hao rubber keys for insane grip, and a few red accents added for some flare, with our signature space bar as the cherry on top.</p>\n<p>It’s thicc, it’s snappy, it’s aggressive; this board is like a Lambo Diablo of gaming. WROOM! We know the customer will be pleased, we would.</p>\n<p>Details:</p>\n<ul>\n<li>Black Anode Aluminum case</li>\n<li>GK64 hotswap full RGB PCB</li>\n<li>Modded stock GK64 alu plate</li>\n<li>Kailh Box Browns</li>\n<li>Band-aid modded, lubed stock GK64 stabilizers</li>\n<li>Stock GK64 + Black Pudding + Red Tai-Hao Rubber + Red misc accents + Signature 3Bd space bar</li>\n<li>Full RGB</li>\n</ul>\n"},{"id":"gonzo-gaming-ducky-one-2-sf-rgb","name":"Gonzo Gaming — Ducky One 2 SF RGB","date":"2020-04-29","images":[{"name":"gonzo-gaming-ducky-one-2-sf-rgb.png","width":1356,"height":450}],"status":"available","type":"65%","switches":"kailh speed copper","colors":["black","red"],"wired":"usb-c","wireless":null,"numberOfKeys":67,"lighting":"rgb","dimensions":{"width":325,"height":0,"length":108},"weight":0,"contentHtml":"<p>This right here is the daily driver of the Butcher himself, a slightly modified Ducky One 2 SF RGB.</p>\n<p>65% might be the absolutely best size for a keyboard. Why? Dedicated arrow keys without being cramped in a 60% case, yet small enough that you won’t hit your mouse to the side of the board when making those big swipes.</p>\n<p>This specific board came with MX Speed Silver switches; an absolute atrocity typing on and quite difficult to game on as even the slightest touch would trigger the keys. We swapped the MX Speed Silver to Kailh Speed Copper switches, which have a slight bump early in the stroke, avoiding unnecessary key presses, yet keeping that short travel and quick response. Switches are lubed with GPL 203 but not modded in any other way. Caps are a combination of GK64 Black backlits, our 3Bd signature space bar and stock Ducky accents.</p>\n<p>The result is a game dominating tool for the highest level gaming experience, at a price that will leave plenty room for all those post game celebration parties you’ll be having.</p>\n<p>Details:</p>\n<ul>\n<li>Kailh Speed Copper lubed with GPL 203</li>\n<li>Band-aid modded, lubed stock Ducky stabilizers</li>\n<li>GK64 Black backlit + Custom Space + Ducky Accent caps</li>\n<li>Full RGB</li>\n<li>Not just the best, but the Beast budget gaming keyboard</li>\n</ul>\n"},{"id":"subtle-6ixty-rk61","name":"Subtle 6ixty — RK61","date":"2020-04-29","images":[{"name":"subtle-6ixty-rk61.png","width":1308,"height":450}],"status":"available","type":"60%","switches":"gateron clear","colors":["black","white","red"],"wired":"usb-c","wireless":{"chip":"bluetooth 5.1","battery":"1450mAh"},"numberOfKeys":61,"lighting":"red","dimensions":{"width":292,"height":0,"length":102},"weight":0,"contentHtml":"<p>Another Royal Kludge Bluetooth USB-C combo board. Not much to celebrate in its original form but with a bit of TLC it turned out quite well.</p>\n<p>It all started with a basic Red led RK60 with Outemo Browns. Stabs were absolutely horrible and the entire board rattled more than a rattlesnake. We swapped out the subpar switches with modded Gateron Clears w 80g Cherry springs, lubed with GPL 205, and filmed with clear Kin switch films. Base caps were swapped to a white backlit with red accents and an artisan space bar.</p>\n<p>The result, although not visually extravagant is a well performing board that handles gaming as well as office work, if you consider those different. Typing is buttery smooth with a thicc sound, but certainly not for the weak with those massive springs.</p>\n<p>Details:</p>\n<ul>\n<li>Lubed, filmed, Gateron Clears w 80g Cherry springs</li>\n<li>Clipped, band-aid modded, lubed stock stabilizers</li>\n<li>Original + white base backlit + red accents + artisan space caps</li>\n<li>Red PCB leds</li>\n<li>All-arounder in a small form factor</li>\n</ul>\n"},{"id":"blueberry-ice-rs71","name":"Blueberry Ice — RS71","date":"2020-04-27","images":[{"name":"blueberry-ice-rs71.png","width":1443,"height":450}],"status":"sold","type":"70%","switches":"kailh speed copper","colors":["white","blue"],"wired":"usb-c","wireless":{"chip":"bluetooth 5.1","battery":"1000mAh"},"numberOfKeys":71,"lighting":"rgb","dimensions":{"width":330,"height":0,"length":102},"weight":0,"contentHtml":"<p>This is a commission build to a dear friend making his way through the ranks with an old membrane board. The poor man couldn’t keep up with the speed of a new generation of gamers and was looking to upgrade his equipment. He wanted a smaller sized board, with RGB, tuned and perfected to dominate the opposition without breaking the bank.</p>\n<p>We took a basic RoyalKludge RK71, swapped out the tired Gateron Browns with a full set of Kailh Speed Copper, lubed with a magic GPL 203 and 105 mixture. Stabs were clipped, band-aid modded, and lubed for a smooth yet violent sound. Accent caps from an Akko 3068.</p>\n<p>Details:</p>\n<ul>\n<li>Lubed Kailh Speed Copper switches</li>\n<li>Clipped, band-aid modded, lubed stock stabilizers</li>\n<li>Original caps + Akko accents</li>\n<li>Full RGB + side RGB</li>\n<li>Tested and proven worthy of leaderboard domination</li>\n</ul>\n"},{"id":"color-crazy-dz60","name":"Color Crazy — DZ60","date":"2020-04-27","images":[{"name":"color-crazy-dz60.png","width":1325,"height":450}],"status":"repurposed","type":"60%","switches":"gateron clear","colors":["white","lightblue","blue","yellow"],"wired":"usb-c","wireless":null,"numberOfKeys":64,"lighting":"rgb","dimensions":{"width":310,"height":0,"length":110},"weight":0,"contentHtml":"<p>The R3Bd V2 was a little project to make one helluva glowing RGBeast and build something from scratch. A keyboard made for everyday use, compact, sleek, yet in your face with insane glow.</p>\n<p>Run it in full RGB for a lovely rainbow effect or turn off the top leds and underglow for a subtle white/blue shaded board with its clear case, reminding of the patio in a intermediate beach patio.</p>\n<p>We took a basic clear case, a clear plastic plate and a Kebo DZ60RGB underglow PCB. The board was modded to fit the GK64 layout in QMK. Switches are Gateron Clears modded with 80g Cherry springs, filmed, and lubed with GPL 205. Caps are Ducky Bon Voyage and an assortment of Cherry profile accents, with backlit arrow cluster and space. Approximately 1 lbs of aquarium weights were added to the bottom of the case to balance the light weight of the components (see side view).</p>\n<p>Details:</p>\n<ul>\n<li>Clear plastic case and plate</li>\n<li>Kebo DZ60RGB PCB</li>\n<li>Modded Gateron Clears w 80g Cherry springs, lubed, filmed</li>\n<li>Clipped, band-aid modded, lubed Cherry stabilizers</li>\n<li>Ducky Bon Voyage, White backlit, assorted Cherry caps</li>\n<li>Full underglow RGB, 1.8mm red leds, 1.8mm white Caps Lock led</li>\n<li>Can illuminate the entire continent</li>\n</ul>\n"}]